var messages = [];
messages[0] = "Оберіть назву для своїх параметрів інкубації. Якщо залишити пустим - назву буде створено автоматично.";
messages[1] = "Вибір виду птиці, відносно якого будуть розраховані параметри інкубації.";
messages[2] = "Вибір числа коли закладено яйця. При скиданні встановлюється поточне.";
messages[3] = "Вибір місяця коли закладено яйця. При скиданні встановлюється поточний.";
messages[4] = "Вибір року в якому закладено яйця. При скиданні встановлюється поточний.";
messages[5] = "Натисніть \"Ok\" щоб розрахувати графік інкубації, або \"Скинути\" щоб обрати параметри по умовчуванню та поточну дату. Не забудьте зробити закладку на розраховану сторінку.";
messages[6] = "\"Назад\" - повернутись на попередню сторінку. \"Новий\" - зробити новий розрахунок. Не забудьте зробити закладку на розраховану сторінку.";
messages[7] = "Невірна дата!";
function showHelp(msg){
   alert(messages[msg]);
}
function help(msg){
   return "<input type=\"button\" value=\"?\" onclick=\"showHelp(" + msg + ")\">";
}
